## Baby Challenge
### Imports

In [240]:
import pandas as pd

#### Task 1
Inspect the file `yob2021.txt` in a text editor. What do you observe about the structure of the file?

Usually these questions are the most relevant:

- How many columns are there?
- How are columns separated?
- Is there a header on top of the files?

#### Task 2
Read the file `yob2021.txt` into pandas.

In [244]:
df = pd.read_csv('names/yob2021.txt', index_col=False, sep=',', header=None, names=['Name', 'Gender', 'Total'])

#### Task 3
Print the first 10 rows.

In [247]:
df.head(10)

        Name Gender  Total
0     Olivia      F  17824
1       Emma      F  15530
2  Charlotte      F  13352
3     Amelia      F  13024
4        Ava      F  12854
5     Sophia      F  12559
6   Isabella      F  11288
7        Mia      F  11157
8     Evelyn      F   9484
9     Harper      F   8433

#### Task 4
Display the number of rows and columns.

In [250]:
df.shape

(31729, 3)

#### Task 5
Calculate the total number of babies born in 2021, i.e. the sum of the third column.

In [253]:
total_babies = df["Total"].sum()
total_babies

3384687

#### Task 6
Like Task 5, but calculate the sum for boys and girls separately.

In [256]:
total_boys = df[df["Gender"] == "M"]["Total"].sum()
total_girls = df[df["Gender"] == "F"]["Total"].sum()

total_boys, total_girls

(1746499, 1638188)

#### Task 7
Check if your name occurs in the data.

In [259]:
df[df["Name"] == "Markus"]

         Name Gender  Total
18779  Markus      M    180

#### Task 8
Calculate the percentage of girls and boys among the total births.

In [262]:
percentage_boys = (total_boys / total_babies).round(4) * 100
percentage_girls = (total_girls / total_babies).round(4) * 100
percentage_boys, percentage_girls

(51.6, 48.4)

#### Task 9
Create a table that contains the top 5 girls names and top 5 boys names.

In [265]:
top5_boys = df[df["Gender"] == "M"].nlargest(5,"Total")
top5_girls = df[df["Gender"] == "F"].nlargest(5,"Total")
top5 = pd.concat([top5_boys, top5_girls])
top5

            Name Gender  Total
17649       Liam      M  20391
17650       Noah      M  18884
17651     Oliver      M  14696
17652     Elijah      M  12807
17653      James      M  12452
0         Olivia      F  17824
1           Emma      F  15530
2      Charlotte      F  13352
3         Amelia      F  13024
4            Ava      F  12854

#### Task 10
Write the data from task 9 to an Excel spreadsheet.

In [268]:
top5.to_excel('top5_boys_girls_names_2021.xlsx')